[
{
"tailscaleTermsVersion":"1.0",
"latest":true,
"tailscaleTermsText":
"<div class='tailscale-terms'><h1>Homecloud Tailscale VPN Terms of Use and Disclaimer</h1><p><strong>Last Updated:</strong> June 2025<br><strong>Applies to:</strong> All users enabling Tailscale VPN access (free or paid) on Homecloud devices</p><h3>1. Purpose</h3><p>By enabling Tailscale VPN on your Homecloud device, you acknowledge that this feature is provided to facilitate remote access to your device over the internet using Tailscale’s peer-to-peer mesh VPN infrastructure. Tailscale is a third-party service governed by its own terms and policies. Libernest Technologies Pvt. Ltd. (‘Libernest’) does not operate, maintain, or control the Tailscale network or its infrastructure.</p><h3>2. User Responsibility</h3><p>By activating the Tailscale integration, you agree and acknowledge that:</p><ul><li>You are solely responsible for reviewing and complying with Tailscale’s <a href='https://tailscale.com/terms/'>Terms of Service</a> and <a href='https://tailscale.com/privacy/'>Privacy Policy</a>.</li><li>You are fully responsible for managing access keys, authentication, and security settings related to your Tailscale network.</li><li>You understand that remote access exposes Homecloud to the public internet, increasing risk from unauthorized access or intrusion, potential security breaches, data theft, modification, or deletion, and loss of privacy or control.</li></ul><h3>3. No Warranty or Liability</h3><p>Libernest Technologies Pvt. Ltd. provides the Tailscale integration as a convenience feature only, and makes no guarantees about its reliability, security, or performance.</p><p>We expressly disclaim:</p><ul><li>Any warranties regarding the availability, uptime, or functionality of the VPN service.</li><li>Any liability for incidents involving unauthorized access to your Homecloud, compromise of personal or sensitive data, malicious traffic, data leaks, or privacy loss, damage to third-party systems or violations of network policies.</li></ul><h3>4. Consent and Assumption of Risk</h3><p>By signing up for and using Tailscale through Homecloud:</p><ul><li>You consent to your device being reachable over a VPN connection or public Internet.</li><li>You accept all risks associated with exposing networked services to the internet.</li><li>You agree that you are solely responsible for firewall rules, access control policies, VPN account security, and any consequences resulting from VPN usage.</li></ul><h3>5. Limitation of Support</h3><p>Libernest provides basic integration assistance only. We do not offer technical support for Tailscale account issues (billing, limits, login, etc.), advanced VPN configuration or troubleshooting, or security audits or penetration testing.</p><h3>6. Opt-Out Option</h3><p>If you do not agree to these terms, you should not enable or use the Tailscale VPN feature in Homecloud. You may still use Homecloud within your local network without Tailscale.</p><h3>7. Acknowledgment</h3><p>By enabling Tailscale on Homecloud, you acknowledge that you have read, understood, and accepted this disclaimer and terms of use. You understand that Libernest Technologies Pvt. Ltd. shall not be liable for any claims or damages resulting from the use of Tailscale VPN with Homecloud.</p></div>"
}
]
